Revit 2027 API
CameraInfo.IsPespective Property
 Identifies whether the projection is orthographic or perspective
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPespective { get; }
Public ReadOnly Property IsPespective As Boolean
	Get
public:
property bool IsPespective {
	bool get ();
}
member IsPespective : bool with get
Property Value
Boolean
See Also
Reference
CameraInfo Class
Autodesk.Revit.DB Namespace